NamDuong-EE/esp32-um982-esp_now-base/src/hardware/BaseEspnow_sender.cpp
void startPairingMode()
{
    const uint32_t now = millis();
    portENTER_CRITICAL(&pairingMux);
    pairingActive = true;
    pendingPairResponse = false;
    pairingEndsAtMs = now + PAIRING_WINDOW_MS;
    pairingBaseNonce = esp_random();
    lastDiscoverySentAtMs = 0;
    portEXIT_CRITICAL(&pairingMux);
    setPairingActiveStat(true);
    Serial.printf("[BASE][PAIR] Pairing mode ON for %lu ms, network_id=0x%08lX\n",
                  static_cast<unsigned long>(PAIRING_WINDOW_MS),
                  static_cast<unsigned long>(ESPNOW_NETWORK_ID));
}

void stopPairingMode(const char* reason)
{
    portENTER_CRITICAL(&pairingMux);
    pairingActive = false;
    pendingPairResponse = false;
    portEXIT_CRITICAL(&pairingMux);
    setPairingActiveStat(false);
    Serial.print("[BASE][PAIR] Pairing mode OFF");
    if (reason != nullptr) {
        Serial.print(": ");
        Serial.print(reason);
    }
    Serial.println();
}

void sendPairDiscoveryIfDue()
{
    bool active = false;
    uint32_t nonce = 0;
    uint32_t lastSent = 0;
    const uint32_t now = millis();

    portENTER_CRITICAL(&pairingMux);
    active = pairingActive;
    nonce = pairingBaseNonce;
    lastSent = lastDiscoverySentAtMs;
    if (active && (lastSent == 0 || now - lastSent >= PAIR_DISCOVERY_INTERVAL_MS)) {
        lastDiscoverySentAtMs = now;
        lastSent = 0;
    }
    portEXIT_CRITICAL(&pairingMux);

    if (!active || lastSent != 0) {
        return;
    }

    RtcmEspNowPairDiscovery discovery{};
    discovery.common.magic = RTCM_ESPNOW_MAGIC;
    discovery.common.version = RTCM_ESPNOW_VERSION;
    discovery.common.packetType = RTCM_ESPNOW_PACKET_TYPE_PAIR_DISCOVERY;
    discovery.role = RTCM_ESPNOW_ROLE_BASE;
    discovery.networkId = ESPNOW_NETWORK_ID;
    discovery.baseDeviceId = localDeviceId();
    discovery.baseNonce = nonce;
    discovery.pairingWindowMs = PAIRING_WINDOW_MS;
    discovery.authTag = rtcmEspNowPairingAuthTag(discovery,
                                                 ESPNOW_PAIRING_KEY,
                                                 sizeof(ESPNOW_PAIRING_KEY));

    sendControlPacket(BROADCAST_MAC,
                      reinterpret_cast<const uint8_t*>(&discovery),
                      sizeof(discovery));
}

void processPendingPairResponse()
{
    RtcmEspNowPairResponse response{};
    uint8_t sourceMac[6] = {};
    uint32_t expectedNonce = 0;
    bool hasPending = false;

    portENTER_CRITICAL(&pairingMux);
    hasPending = pendingPairResponse;
    expectedNonce = pairingBaseNonce;
    if (hasPending) {
        response = pendingPairResponsePacket;
        std::memcpy(sourceMac, pendingPairResponseMac, sizeof(sourceMac));
        pendingPairResponse = false;
    }
    portEXIT_CRITICAL(&pairingMux);

    if (!hasPending) {
        return;
    }

    if (!rtcmEspNowValidatePairResponse(response,
                                        sizeof(response),
                                        ESPNOW_NETWORK_ID,
                                        expectedNonce,
                                        ESPNOW_PAIRING_KEY,
                                        sizeof(ESPNOW_PAIRING_KEY))) {
        incrementStat(&BaseEspnowStats::pairAuthFailures);
        Serial.println("[BASE][PAIR][WARN] Invalid PAIR_RESPONSE from " + macToString(sourceMac));
        return;
    }

    if (!addEspNowPeer(sourceMac, false)) {
        return;
    }

    RtcmEspNowPairConfirm confirm{};
    confirm.common.magic = RTCM_ESPNOW_MAGIC;
    confirm.common.version = RTCM_ESPNOW_VERSION;
    confirm.common.packetType = RTCM_ESPNOW_PACKET_TYPE_PAIR_CONFIRM;
    confirm.role = RTCM_ESPNOW_ROLE_BASE;
    confirm.networkId = ESPNOW_NETWORK_ID;
    confirm.baseNonce = response.baseNonceEcho;
    confirm.roverNonce = response.roverNonce;
    confirm.authTag = rtcmEspNowPairingAuthTag(confirm,
                                               ESPNOW_PAIRING_KEY,
                                               sizeof(ESPNOW_PAIRING_KEY));

    if (!sendControlPacket(sourceMac,
                           reinterpret_cast<const uint8_t*>(&confirm),
                           sizeof(confirm))) {
        Serial.println("[BASE][PAIR][ERROR] Gui PAIR_CONFIRM that bai");
        return;
    }

    incrementStat(&BaseEspnowStats::pairResponsesReceived);
    incrementStat(&BaseEspnowStats::pairConfirmsSent);
    if (!saveRoverToNvs(sourceMac)) {
        Serial.println("[BASE][PAIR][ERROR] Luu Rover MAC vao NVS that bai");
        return;
    }

    Serial.println("[BASE][PAIR] Paired Rover " + macToString(sourceMac));
    stopPairingMode("paired");
}
}

bool setupEspNowBase()
{
    sendCallbackSemaphore = xSemaphoreCreateBinary();
    frameAckSemaphore = xSemaphoreCreateBinary();
    espnowSendMutex = xSemaphoreCreateMutex();
    if (sendCallbackSemaphore == nullptr || frameAckSemaphore == nullptr ||
        espnowSendMutex == nullptr) {
        Serial.println("[BASE][ESP-NOW][ERROR] Failed to create semaphores");
        return false;
    }

    setupPairingButton();

    WiFi.mode(WIFI_STA);
    WiFi.disconnect(false, true);
    delay(50);
    if (!configureMaxTxPower()) {
        return false;
    }

    esp_wifi_set_ps(WIFI_PS_NONE);

    uint8_t protocol = WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N;
#ifdef WIFI_PROTOCOL_LR
    if (ESPNOW_USE_LR_250KBPS) {
        protocol |= WIFI_PROTOCOL_LR;
    }
#endif
    esp_wifi_set_protocol(WIFI_IF_STA, protocol);

    esp_err_t result = esp_wifi_set_channel(ESPNOW_WIFI_CHANNEL, WIFI_SECOND_CHAN_NONE);
    if (result != ESP_OK) {
        Serial.printf("[BASE][ESP-NOW][ERROR] esp_wifi_set_channel failed: %d\n", result);
        return false;
    }

    result = esp_now_init();
    if (result != ESP_OK) {
        Serial.printf("[BASE][ESP-NOW][ERROR] esp_now_init failed: %d\n", result);
        return false;
    }

    result = esp_now_register_send_cb(onDataSent);
    if (result != ESP_OK) {
        Serial.printf("[BASE][ESP-NOW][ERROR] register send callback failed: %d\n", result);
        return false;
    }
    result = esp_now_register_recv_cb(onDataReceived);
    if (result != ESP_OK) {
        Serial.printf("[BASE][ESP-NOW][ERROR] register receive callback failed: %d\n", result);
        return false;
    }

    if (ESPNOW_ENCRYPTION_ENABLED) {
        result = esp_now_set_pmk(ESPNOW_PMK);
        if (result != ESP_OK) {
            Serial.printf("[BASE][ESP-NOW][ERROR] esp_now_set_pmk failed: %d\n", result);
            return false;
        }
    }

    if (ESPNOW_PAIRING_ENABLED) {
        addEspNowPeer(BROADCAST_MAC, false);
    }
    loadStoredRovers();
    updatePeerStats();
    const BaseEspnowStats loadedPeerStats = getBaseEspnowStats();
    if (loadedPeerStats.activeRoverCount == 0) {
        if (ESPNOW_PAIRING_ENABLED) {
            Serial.println("[BASE][PAIR][WARN] No Rover MAC in NVS; hold pairing button to pair");
        } else {
            Serial.println("[BASE][ESP-NOW][ERROR] No Rover MAC in NVS and pairing disabled");
            return false;
        }
    }

#if defined(WIFI_PHY_RATE_LORA_250K)
    if (ESPNOW_USE_LR_250KBPS) {
        result = esp_wifi_config_espnow_rate(WIFI_IF_STA, WIFI_PHY_RATE_LORA_250K);
        if (result != ESP_OK) {
            Serial.printf("[BASE][ESP-NOW][WARN] espnow LR rate config failed: %d\n", result);
        }
    }
#endif

